README.org
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/2.5.0/
#+TITLE: Prairie Hill Learning Center Website
#+AUTHOR: AnderSon
#+EMAIL: son@lincolnix.net
#+OPTIONS: toc:nil num:nil


* Prairie Hill Learning Center

  http://phill-new.herokuapp.com

  - [ ] re-route http://www.prairiehill.com => heroku app

** Essential Files

   [[./FILES.org]]

*** excel export

    http://railscasts.com/episodes/362-exporting-csv-and-excel

* Description

  After over 2 years of cumbersome working with the wordpress managed website 
  content for the Prairie Hill website (whether due to the way that wordpress 
  arranges itself or my own ignorance and lack of education in web design, php, 
  etc), this is an attempt to try something new. Having a nice solid foundation 
  in building an application with Rails, I feel like now is the time to build 
  something from the ground up that will hopefully meet my needs for control 
  and understanding for building and modifying the backend functionality 
  (most importantly without having to go through all of hassle of using the 
  actual web content management editors and having so many extraneous steps,
  instead of just using my text editor...), as well as the front end need
  for admin staff to update content, which is what is important to them in
  the basic functionality of the site. I take care of the functionality and
  aesthetic; they give it the words.

** NB

*** What we need to look at for functionality:

**** mailer contact

    http://rubyonrailshelp.wordpress.com/2014/01/08/rails-4-simple-form-and-mail-form-to-make-contact-form/

    set up successfully in development
    
    - [ ] change heroku configs to prairiehill email authentication for production






**** user accounts

  - [ ] We need USERs with authenticatable accounts
    
    These users will have various access to update content and that's really
    all that they need. However,

    - [ ] Admin/General user

       https://github.com/plataformatec/devise/wiki/How-To:-Add-an-Admin-Role

      We will have user accounts for general things like summer camp and 
      country fair sign up

      We will also have admin users who also have access to CMS

      - [ ] install & configure RailsAdmin

            https://github.com/sferik/rails_admin

	- [ ] bundle the gem
	
	    : gem 'rails_admin'
	    : bundle install

	- [ ] install RailsAdmin

	      : rails g rails_admin:install

	- [ ] configure for Devise

	  https://github.com/sferik/rails_admin/wiki/Devise

    - [ ] Using ComfortableMexicanSofa for Content Management

      - [ ] already set up to use Paperclip for images

      - [ ] WYSIWYG

	[[./app/assets/stylesheets/comfortable_mexican_sofa/admin/application.css]]

	  - [X] editor window is very short

    - [ ] Private content

      - [ ] admin vs common user accounts

    - [ ] User profiles?

    - [ ] Summer Camp Registration model?

    - [ ] Volunteers/CCF
      
      - [ ] connect devise users with shifts?

      - [ ] Sign up views

	- [ ] if user signed in...

	- [ ] time to learn some jQuery!

	- [ ] FIRST: Shows Activity titles and a number of volunteers total needed
	  
	- [ ] SECOND: Clicking on one of the FIRST shows a view of specific times
	  and number of volunteers still needed for each, just after a description
	  of the activity itself

	  - [ ] checkboxes for selected desired shifts?
	    
	  - [ ] ability to remove volunteer from shifts

	- [ ] BLOG/NEWSfeed for news updates?

	- [ ] PAGEs for general website content


* ModelViewControl

** Model

   Pages

   [[./app/controllers/pages_controller.rb]]
   [[./app/models/page.rb]]

*** Page

    - [X] Create Static Pages

      http://www.railstutorial.org/book/static_pages

      - [X] Generate a Pages controller

	[[./app/controllers/static_pages_controller.rb]]
	[[./config/routes.rb]]

	: rails g controller StaticPages home


*** Rails Generation

**** Scaffolding

     - [X] Disable scaffold stylesheet creation 

       [[./config/application.rb]]

       	: config.generators do |g|
       	:   g.stylesheets false
       	: end

     - [ ] Generate a scaffold

       EXAMPLE
       : rails g scaffold Page index

     - [ ] migrate the database

       : rake db:migrate


** View

*** Skrollr   

    https://github.com/reed/skrollr-rails

    ???"@import 'skrollr';" in [[./app/assets/stylesheets/bootstrap_and_customization.css.scss]]?

    - [X] add skrollr script

      - [X] make sure skrollr-rails is in the Gemfile

        [[./Gemfile]]

	: gem 'skrollr-rails'

      - [X] add the following script just before </body> tag

	[[./app/views/layouts/application.html.erb]]

	: <script>
        :  (function($){
	:    skrollr.init({
	:      forceHeight: false,
	:      smoothScrolling: false
	:    }).refresh();
        :  } (jQuery));
	: </script>

      - [X] Place #skrollr-body div tag around <%= yield %> tag

	: <div id="skrollr-body">


    - [X] require skrollr in application.js

      [[./app/assets/javascripts/application.js]]

      : //= require skrollr

      - [X] For IE compatibility

	: //= require skrollr
	: //= require skrollr.ie

      - [X] This plugin makes hashlinks scroll nicely to their target position.

	: //= require skrollr
	: //= require skrollr.menu
      

