README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Prairie Hill Learning Center Website</title>
<!-- 2014-07-12 Sat 08:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="AnderSon" />
</head>
<body>
<div id="content">
<h1 class="title">Prairie Hill Learning Center Website</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Prairie Hill Learning Center</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://phill-new.herokuapp.com">http://phill-new.herokuapp.com</a>
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> re-route <a href="http://www.prairiehill.com">http://www.prairiehill.com</a> =&gt; heroku app
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Essential Files</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="./FILES.html">./FILES.html</a>
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">excel export</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<a href="http://railscasts.com/episodes/362-exporting-csv-and-excel">http://railscasts.com/episodes/362-exporting-csv-and-excel</a>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Description</h2>
<div class="outline-text-2" id="text-2">
<p>
After over 2 years of cumbersome working with the wordpress managed website 
content for the Prairie Hill website (whether due to the way that wordpress 
arranges itself or my own ignorance and lack of education in web design, php, 
etc), this is an attempt to try something new. Having a nice solid foundation 
in building an application with Rails, I feel like now is the time to build 
something from the ground up that will hopefully meet my needs for control 
and understanding for building and modifying the backend functionality 
(most importantly without having to go through all of hassle of using the 
actual web content management editors and having so many extraneous steps,
instead of just using my text editor&#x2026;), as well as the front end need
for admin staff to update content, which is what is important to them in
the basic functionality of the site. I take care of the functionality and
aesthetic; they give it the words.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">NB</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">What we need to look at for functionality:</h4>
<div class="outline-text-4" id="text-2-1-1">
</div><ul class="org-ul"><li>mailer contact<br  /><div class="outline-text-5" id="text-2-1-1-1">
<p>
<a href="http://rubyonrailshelp.wordpress.com/2014/01/08/rails-4-simple-form-and-mail-form-to-make-contact-form/">http://rubyonrailshelp.wordpress.com/2014/01/08/rails-4-simple-form-and-mail-form-to-make-contact-form/</a>
</p>

<p>
set up successfully in development
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> change heroku configs to prairiehill email authentication for production
</li>
</ul>
</div>
</li>






<li>user accounts<br  /><div class="outline-text-5" id="text-2-1-1-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> We need USERs with authenticatable accounts

<p>
These users will have various access to update content and that's really
all that they need. However,
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> Admin/General user

<p>
<a href="https://github.com/plataformatec/devise/wiki/How-To:-Add-an-Admin-Role">https://github.com/plataformatec/devise/wiki/How-To:-Add-an-Admin-Role</a>
</p>

<p>
We will have user accounts for general things like summer camp and 
country fair sign up
</p>

<p>
We will also have admin users who also have access to CMS
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> install &amp; configure RailsAdmin

<p>
<a href="https://github.com/sferik/rails_admin">https://github.com/sferik/rails_admin</a>
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> bundle the gem

<pre class="example">
gem 'rails_admin'
bundle install
</pre>
</li>

<li><code>[&#xa0;]</code> install RailsAdmin

<pre class="example">
rails g rails_admin:install
</pre>
</li>

<li><code>[&#xa0;]</code> configure for Devise

<p>
<a href="https://github.com/sferik/rails_admin/wiki/Devise">https://github.com/sferik/rails_admin/wiki/Devise</a>
</p>
</li>
</ul>
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> Using ComfortableMexicanSofa for Content Management

<ul class="org-ul">
<li><code>[&#xa0;]</code> already set up to use Paperclip for images
</li>

<li><code>[&#xa0;]</code> WYSIWYG

<p>
<a href="./app/assets/stylesheets/comfortable_mexican_sofa/admin/application.css">./app/assets/stylesheets/comfortable_mexican_sofa/admin/application.css</a>
</p>

<ul class="org-ul">
<li><code>[X]</code> editor window is very short
</li>
</ul>
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> Private content

<ul class="org-ul">
<li><code>[&#xa0;]</code> admin vs common user accounts
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> User profiles?
</li>

<li><code>[&#xa0;]</code> Summer Camp Registration model?
</li>

<li><code>[&#xa0;]</code> Volunteers/CCF

<ul class="org-ul">
<li><code>[&#xa0;]</code> connect devise users with shifts?
</li>

<li><code>[&#xa0;]</code> Sign up views

<ul class="org-ul">
<li><code>[&#xa0;]</code> if user signed in&#x2026;
</li>

<li><code>[&#xa0;]</code> time to learn some jQuery!
</li>

<li><code>[&#xa0;]</code> FIRST: Shows Activity titles and a number of volunteers total needed
</li>

<li><code>[&#xa0;]</code> SECOND: Clicking on one of the FIRST shows a view of specific times
and number of volunteers still needed for each, just after a description
of the activity itself

<ul class="org-ul">
<li><code>[&#xa0;]</code> checkboxes for selected desired shifts?
</li>

<li><code>[&#xa0;]</code> ability to remove volunteer from shifts
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> BLOG/NEWSfeed for news updates?
</li>

<li><code>[&#xa0;]</code> PAGEs for general website content
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</li></ul>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">ModelViewControl</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Model</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Pages
</p>

<p>
<a href="./app/controllers/pages_controller.rb">./app/controllers/pages_controller.rb</a>
<a href="./app/models/page.rb">./app/models/page.rb</a>
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">Page</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li><code>[X]</code> Create Static Pages

<p>
<a href="http://www.railstutorial.org/book/static_pages">http://www.railstutorial.org/book/static_pages</a>
</p>

<ul class="org-ul">
<li><code>[X]</code> Generate a Pages controller

<p>
<a href="./app/controllers/static_pages_controller.rb">./app/controllers/static_pages_controller.rb</a>
<a href="./config/routes.rb">./config/routes.rb</a>
</p>

<pre class="example">
rails g controller StaticPages home
</pre>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">Rails Generation</h4>
<div class="outline-text-4" id="text-3-1-2">
</div><ul class="org-ul"><li>Scaffolding<br  /><div class="outline-text-5" id="text-3-1-2-1">
<ul class="org-ul">
<li><code>[X]</code> Disable scaffold stylesheet creation 

<p>
<a href="./config/application.rb">./config/application.rb</a>
</p>

<pre class="example">
config.generators do |g|
  g.stylesheets false
end
</pre>
</li>

<li><code>[&#xa0;]</code> Generate a scaffold

<p>
EXAMPLE
</p>
<pre class="example">
rails g scaffold Page index
</pre>
</li>

<li><code>[&#xa0;]</code> migrate the database

<pre class="example">
rake db:migrate
</pre>
</li>
</ul>
</div>
</li></ul>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">View</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">Skrollr</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
<a href="https://github.com/reed/skrollr-rails">https://github.com/reed/skrollr-rails</a>
</p>

<p>
???"@import 'skrollr';" in <a href="./app/assets/stylesheets/bootstrap_and_customization.css.scss">./app/assets/stylesheets/bootstrap_and_customization.css.scss</a>?
</p>

<ul class="org-ul">
<li><code>[X]</code> add skrollr script

<ul class="org-ul">
<li><code>[X]</code> make sure skrollr-rails is in the Gemfile

<p>
<a href="./Gemfile">./Gemfile</a>
</p>

<pre class="example">
gem 'skrollr-rails'
</pre>
</li>

<li><code>[X]</code> add the following script just before &lt;/body&gt; tag

<p>
<a href="./app/views/layouts/application.html.erb">./app/views/layouts/application.html.erb</a>
</p>

<pre class="example">
&lt;script&gt;
 (function($){
   skrollr.init({
     forceHeight: false,
     smoothScrolling: false
   }).refresh();
 } (jQuery));
&lt;/script&gt;
</pre>
</li>

<li><code>[X]</code> Place #skrollr-body div tag around &lt;%= yield %&gt; tag

<pre class="example">
&lt;div id="skrollr-body"&gt;
</pre>
</li>
</ul>
</li>
</ul>


<ul class="org-ul">
<li><code>[X]</code> require skrollr in application.js

<p>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>

<pre class="example">
//= require skrollr
</pre>

<ul class="org-ul">
<li><code>[X]</code> For IE compatibility

<pre class="example">
//= require skrollr
//= require skrollr.ie
</pre>
</li>

<li><code>[X]</code> This plugin makes hashlinks scroll nicely to their target position.

<pre class="example">
//= require skrollr
//= require skrollr.menu
</pre>
</li>
</ul>
</li>
</ul>
</div>
</div>
