README.org
*** Bootstrap-sass
    
    - [X] Create custom bootstrap stylesheet

      [[./app/assets/stylesheets/bootstrap_and_customization.css.scss]]
      
      - [X] create file

            : echo "@import 'bootsrap';" > app/assets/stylesheets/bootstrap_and_customization.css.scss

      *NOTE* Place new variables before "@import 'bootstrap'"

      - [X] Fonts

  	    /EXAMPLE:/
	    : @import url(http://fonts.googleapis.com/css?family=Roboto:400,100,100italic,700italic,700|Clicker+Script);

      - [X] Variables

	    : $phill-grn: #3f8000;

    - [X] Require Bootstrap's Javascript, after jquery_ujs 

      [[./app/assets/javascripts/application.js]]

      : //= require jquery
      : //= require jquery_ujs
      : //= require bootstrap
      : //= require turbolinks
      : //= require_tree .


*** Assets

**** Stylesheets

     [[./app/assets/stylesheets/bootstrap_and_customization.css.scss]]

**** Javascripts

     - [X] Replace turbolinks with jquery-turbolinks

       [[./app/assets/javascripts/application.js]]

       - [X] Check for jquery-turbolinks in Gemfile

	 [[./Gemfile]]

	 : gem 'jquery-turbolinks'
	 : bundle

       - [X] remove turbolinks line

	 : //= require turbolinks

       - [X] add jquery.turbolinks under bootstrap

	 : //= require bootstrap
	 : //= require jquery.turbolinks

	 - [X] Restart the server

**** Images   

     - [X] css background images 

       [[./app/assets/stylesheets/bootstrap_and_customization.css.scss]]

       : background: image-url('image.jpg')
       
     - [ ] run the following command to precompile assets

	  : RAILS_ENV=production bundle exec rake assets:precompile

     - [ ] set video as background?

       

*** Views

**** Application

    [[./app/views/]]

    - [X] add viewport

      [[./app/views/layouts/application.html.erb]]

      : <meta name="viewport" content="width=device-width, intial-scale=1.0">

    - [ ] Optional page refresh interval

        : <meta http-equiv="REFRESH" content="60" />


**** Pages

     [[./app/views/pages/]]
     [[./app/views/pages/pages.org]]


** Control

*** AngularJS (Honeybadger tutorial)
      
      This example from honeybadger may be my key to fixing the issue I am having with
      the the Prairie Hill volunteer sign-up. Let's try it out, first in this sample
      app. Once I understand what is going on and how to impliment Angular, maybe it 
      will be a better solution than all of that erb crap I was trying to use...

      https://www.honeybadger.io/blog/2013/12/11/beginners-guide-to-angular-js-rails

****** Initial setup

       - [X] create the project

       	 : rails new rest --database=postgresql --skip-test-unit

       - [ ] create the PostgreSQL database user:

       	 : createuser -P -s -e rest

       - [ ] Add RSpec to your Gemfile & Install RSpec

       	 [[./Gemfile]]

       	 : gem "rspec-rails", "~> 2.14.0"

       	 : bundle install

       	 : rails g rspec:install

       - [ ] Create the database:

       	 : rake db:create


****** Creating the Restaurant model

       - [ ] Create the Restaurant resource

       	 : rails g scaffold restaurant name:string

       - [ ] Make sure restaurant names are unique

       	 [[./db/migrate/]]

       	 : class CreateRestaurants < ActiveRecord::Migration
       	 :   def change
       	 :     create_table :restaurants do |t|
       	 :       t.string :name
       	 :
       	 :       t.timestamps
       	 :     end
       	 :
       	 :     add_index :restaurants, :name, unique: true
       	 :   end
       	 : end

       	 - [ ] Run the migration

       	   : rake db:migrate

       	 - [ ] Add some specs...
       	   
       	   Need to start learning TDD, but I'm lazy right now


