README.html


<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2">Bootstrap-sass</h4>
<div class="outline-text-4" id="text-3-2-2">
<ul class="org-ul">
<li><code>[X]</code> Create custom bootstrap stylesheet

<p>
<a href="./app/assets/stylesheets/bootstrap_and_customization.css.scss">./app/assets/stylesheets/bootstrap_and_customization.css.scss</a>
</p>

<ul class="org-ul">
<li><code>[X]</code> create file

<pre class="example">
echo "@import 'bootsrap';" &gt; app/assets/stylesheets/bootstrap_and_customization.css.scss
</pre>
</li>
</ul>
<p>
<b>NOTE</b> Place new variables before "@import 'bootstrap'"
</p>

<ul class="org-ul">
<li><code>[X]</code> Fonts

<p>
<i>EXAMPLE:</i>
</p>
<pre class="example">
@import url(http://fonts.googleapis.com/css?family=Roboto:400,100,100italic,700italic,700|Clicker+Script);
</pre>
</li>

<li><code>[X]</code> Variables

<pre class="example">
$phill-grn: #3f8000;
</pre>
</li>
</ul>
</li>

<li><code>[X]</code> Require Bootstrap's Javascript, after jquery<sub>ujs</sub> 

<p>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>

<pre class="example">
//= require jquery
//= require jquery_ujs
//= require bootstrap
//= require turbolinks
//= require_tree .
</pre>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3">Assets</h4>
<div class="outline-text-4" id="text-3-2-3">
</div><ul class="org-ul"><li>Stylesheets<br  /><div class="outline-text-5" id="text-3-2-3-1">
<p>
<a href="./app/assets/stylesheets/bootstrap_and_customization.css.scss">./app/assets/stylesheets/bootstrap_and_customization.css.scss</a>
</p>
</div>
</li>

<li>Javascripts<br  /><div class="outline-text-5" id="text-3-2-3-2">
<ul class="org-ul">
<li><code>[X]</code> Replace turbolinks with jquery-turbolinks

<p>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>

<ul class="org-ul">
<li><code>[X]</code> Check for jquery-turbolinks in Gemfile

<p>
<a href="./Gemfile">./Gemfile</a>
</p>

<pre class="example">
gem 'jquery-turbolinks'
bundle
</pre>
</li>

<li><code>[X]</code> remove turbolinks line

<pre class="example">
//= require turbolinks
</pre>
</li>

<li><code>[X]</code> add jquery.turbolinks under bootstrap

<pre class="example">
//= require bootstrap
//= require jquery.turbolinks
</pre>

<ul class="org-ul">
<li><code>[X]</code> Restart the server
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</li>

<li>Images<br  /><div class="outline-text-5" id="text-3-2-3-3">
<ul class="org-ul">
<li><code>[X]</code> css background images 

<p>
<a href="./app/assets/stylesheets/bootstrap_and_customization.css.scss">./app/assets/stylesheets/bootstrap_and_customization.css.scss</a>
</p>

<pre class="example">
background: image-url('image.jpg')
</pre>
</li>

<li><code>[&#xa0;]</code> run the following command to precompile assets

<pre class="example">
RAILS_ENV=production bundle exec rake assets:precompile
</pre>
</li>

<li><code>[&#xa0;]</code> set video as background?
</li>
</ul>
</div>
</li></ul>
</div>



<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4">Views</h4>
<div class="outline-text-4" id="text-3-2-4">
</div><ul class="org-ul"><li>Application<br  /><div class="outline-text-5" id="text-3-2-4-1">
<p>
<a href="./app/views/">./app/views/</a>
</p>

<ul class="org-ul">
<li><code>[X]</code> add viewport

<p>
<a href="./app/views/layouts/application.html.erb">./app/views/layouts/application.html.erb</a>
</p>

<pre class="example">
&lt;meta name="viewport" content="width=device-width, intial-scale=1.0"&gt;
</pre>
</li>

<li><code>[&#xa0;]</code> Optional page refresh interval

<pre class="example">
&lt;meta http-equiv="REFRESH" content="60" /&gt;
</pre>
</li>
</ul>
</div>
</li>


<li>Pages<br  /><div class="outline-text-5" id="text-3-2-4-2">
<p>
<a href="./app/views/pages/">./app/views/pages/</a>
<a href="./app/views/pages/pages.html">./app/views/pages/pages.html</a>
</p>
</div>
</li></ul>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Control</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1">AngularJS (Honeybadger tutorial)</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
This example from honeybadger may be my key to fixing the issue I am having with
the the Prairie Hill volunteer sign-up. Let's try it out, first in this sample
app. Once I understand what is going on and how to impliment Angular, maybe it 
will be a better solution than all of that erb crap I was trying to use&#x2026;
</p>

<p>
<a href="https://www.honeybadger.io/blog/2013/12/11/beginners-guide-to-angular-js-rails">https://www.honeybadger.io/blog/2013/12/11/beginners-guide-to-angular-js-rails</a>
</p>
</div>

<ul class="org-ul"><li>Initial setup<br  /><div class="outline-text-7" id="text-3-3-1-0-0-1">
<ul class="org-ul">
<li><code>[X]</code> create the project

<pre class="example">
rails new rest --database=postgresql --skip-test-unit
</pre>
</li>

<li><code>[&#xa0;]</code> create the PostgreSQL database user:

<pre class="example">
createuser -P -s -e rest
</pre>
</li>

<li><code>[&#xa0;]</code> Add RSpec to your Gemfile &amp; Install RSpec

<p>
<a href="./Gemfile">./Gemfile</a>
</p>

<pre class="example">
gem "rspec-rails", "~&gt; 2.14.0"
</pre>

<pre class="example">
bundle install
</pre>

<pre class="example">
rails g rspec:install
</pre>
</li>

<li><code>[&#xa0;]</code> Create the database:

<pre class="example">
rake db:create
</pre>
</li>
</ul>
</div>
</li>


<li>Creating the Restaurant model<br  /><div class="outline-text-7" id="text-3-3-1-0-0-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Create the Restaurant resource

<pre class="example">
rails g scaffold restaurant name:string
</pre>
</li>

<li><code>[&#xa0;]</code> Make sure restaurant names are unique

<p>
<a href="./db/migrate/">./db/migrate/</a>
</p>

<pre class="example">
class CreateRestaurants &lt; ActiveRecord::Migration
  def change
    create_table :restaurants do |t|
      t.string :name

      t.timestamps
    end

    add_index :restaurants, :name, unique: true
  end
end
</pre>

<ul class="org-ul">
<li><code>[&#xa0;]</code> Run the migration

<pre class="example">
rake db:migrate
</pre>
</li>

<li><code>[&#xa0;]</code> Add some specs&#x2026;

<p>
Need to start learning TDD, but I'm lazy right now
</p>
</li>
</ul>
</li>
</ul>
</div>
</li>
