README.html


<li>Bringing AngularJS into the mix<br  /><div class="outline-text-7" id="text-3-3-1-0-0-3">
<ul class="org-ul">
<li><code>[X]</code> Create the controller

<pre class="example">
rails g controller static_pages index
</pre>
</li>

<li><code>[X]</code> Update routes

<p>
<a href="./config/routes.rb">./config/routes.rb</a>
</p>

<pre class="example">
root 'static_pages#index'
</pre>
</li>

<li><code>[X]</code> Download Angular

<pre class="example">
wget http://code.angularjs.org/1.1.5/angular.js \
http://code.angularjs.org/1.1.5/angular-mocks.js
</pre>

<pre class="example">
mv angular* app/assets/javascripts
</pre>
</li>

<li><code>[-]</code> Add it to the asset pipeline

<p>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> Remove turbolinks line

<p>
Keeping it in for now as a test
</p>
</li>

<li><code>[&#xa0;]</code> Add the following two lines

<pre class="example">
//= require angular
//= require main
</pre>
</li>

<li><code>[X]</code> Set up the layout

<p>
<a href="./app/views/layouts/application.html.erb">./app/views/layouts/application.html.erb</a>
</p>

<p>
naming the app via angular "phill" for simplicity
keeping turbolinks code in for now until I see a real reason to 
take it out
</p>

<ul class="org-ul">
<li><code>[X]</code> tested taking out turbolinks markup
</li>
</ul>
<pre class="example">
&lt;!DOCTYPE html&gt;
&lt;html ng-app="phill"&gt;
&lt;head&gt;
  &lt;title&gt;Rest&lt;/title&gt;
  &lt;%= stylesheet_link_tag    'application', media: 'all' %&gt;
  &lt;%= javascript_include_tag 'application' %&gt;
  &lt;%= csrf_meta_tags %&gt;
&lt;/head&gt;
&lt;body&gt;

&lt;div ng-view&gt;
  &lt;%= yield %&gt;
&lt;/div&gt;

&lt;/body&gt;
&lt;/html&gt;
</pre>
</li>

<li><code>[X]</code> Creating an Angular controller

<pre class="example">
mkdir -p app/assets/javascripts/angular/controllers
</pre>

<ul class="org-ul">
<li><code>[X]</code> Create the controller

<p>
<a href="./app/assets/javascripts/angular/controllers/HomeCtrl.js.coffee">./app/assets/javascripts/angular/controllers/HomeCtrl.js.coffee</a>
</p>

<pre class="example">
@phill.controller 'HomeCtrl', ['$scope', ($scope) -&gt;

]
</pre>
</li>

<li><code>[X]</code> Add an Angular route

<p>
<a href="./app/assets/javascripts/main.js.coffee">./app/assets/javascripts/main.js.coffee</a>
</p>

<pre class="example">
# This line is related to our Angular app, not to our
# HomeCtrl specifically. This is basically how we tell
# Angular about the existence of our application.
@phill = angular.module('phill', [])
</pre>

<pre class="example">
# This routing directive tells Angular about the default
# route for our application. The term "otherwise" here
# might seem somewhat awkward, but it will make more
# sense as we add more routes to our application.
@phill.config(['$routeProvider', ($routeProvider) -&gt;
  $routeProvider.
    otherwise({
      templateUrl: '../templates/home.html',
      controller: 'HomeCtrl'
    }) 
])
</pre>
</li>

<li><code>[X]</code> Add an Angular template

<pre class="example">
mkdir public/templates
</pre>

<p>
<a href="./public/templates/home.html">./public/templates/home.html</a>
</p>

<pre class="example">
This is the home page
</pre>

<ul class="org-ul">
<li><code>[X]</code> An example of data binding

<p>
<a href="./app/assets/javascripts/angular/controllers/HomeCtrl.js.coffee">./app/assets/javascripts/angular/controllers/HomeCtrl.js.coffee</a>
</p>

<pre class="example">
@phill.controller 'HomeCtrl', ['$scope', ($scope) -&gt;
  $scope.foo = 'bar'        
]
</pre>

<p>
<a href="./public/templates/home.html">./public/templates/home.html</a>
</p>

<pre class="example">
Value of "foo": {{foo}}
</pre>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</li>


<li>Doing it for real this time<br  /><div class="outline-text-7" id="text-3-3-1-0-0-4">
<ul class="org-ul">
<li><code>[&#xa0;]</code> Seed the database

<p>
<a href="./db/seeds.rb">./db/seeds.rb</a>
</p>

<pre class="example">
Restaurant.create([
  { name: "The French Laundry" },
  { name: "Chez Panisse" },
  { name: "Bouchon" },
  { name: "Noma" },
  { name: "Taco Bell" },
])
</pre>

<pre class="example">
rake db:seed
</pre>
</li>

<li><code>[X]</code> Creating a shift index page

<pre class="example">
mkdir public/templates/shifts
</pre>

<p>
<a href="./public/templates/shifts/index.html">./public/templates/shifts/index.html</a>
</p>

<pre class="example">
&lt;a href="/#"&gt;index&lt;/a&gt;
&lt;ul ng-repeat="restaurant in restaurants"&gt;
  &lt;li&gt;
    &lt;a ng-click="viewRestaurant(restaurant.id)"&gt;
      {{ restaurant.name }}
    &lt;/a&gt;
  &lt;/li&gt;
&lt;/ul&gt;
</pre>

<p>
OR rather
</p>

<pre class="example">
&lt;a href="/#"&gt;Shifts&lt;/a&gt;
&lt;ul ng-repeat="shift in shifts"&gt;
  &lt;li&gt;
    &lt;a ng-click="viewShift(shift.id)"&gt;
      {{ shift.title }}
    &lt;/a&gt;
  &lt;/li&gt;
&lt;/ul&gt;
</pre>
</li>

<li><code>[X]</code> Create the controller

<p>
<a href="./app/assets/javascripts/angular/controllers/ShiftIndexCtrl.js.coffee">./app/assets/javascripts/angular/controllers/ShiftIndexCtrl.js.coffee</a>
</p>

<pre class="example">
@rest.controller 'RestaurantIndexCtrl', ['$scope', '$location', '$http', ($scope, $location, $http) -&gt;
  $scope.restaurants = []
  $http.get('./restaurants.json').success((data) -&gt;
    $scope.restaurants = data
  )
]
</pre>

<p>
OR rather
</p>

<pre class="example">
@phill.controller 'ShiftIndexCtrl', ['$scope', '$location', '$http', ($scope, $location, $http) -&gt;
  $scope.shifts = []
  $http.get('./shifts.json').success((data) -&gt;
    $scope.shifts = data
  )
]
</pre>
</li>

<li><code>[X]</code> Adjust routing configuration

<p>
<a href="./app/assets/javascripts/main.js.coffee">./app/assets/javascripts/main.js.coffee</a>
</p>

<pre class="example">
@phill = angular.module('phill', [])

@phill.config(['$routeProvider', ($routeProvider) -&gt;
  $routeProvider.
    when('/shifts', {
      templateUrl: '../templates/shifts/index.html',
      controller: 'ShiftIndexCtrl'
    }).
    otherwise({
      templateUrl: '../templates/home.html',
      controller: 'HomeCtrl'
    })
])
</pre>
</li>
</ul>
</div>
</li>


<li>Adding our first test<br  /><div class="outline-text-7" id="text-3-3-1-0-0-5">
<p>
fill in later
</p>
</div>
</li>
