README.org
****** Building out the shifts page

       When you generate scaffolding in Rails 4, it gives you some .jbuilder files:

       [[./app/views/shifts/index.json.jbuilder]]

       - [X] Add :id parameter for json.extract!

       	 : json.array!(@restaurants) do |restaurant|
       	 :   json.extract! restaurant, :id, :name
       	 :   json.url restaurant_url(restaurant, format: :json)
       	 : end

	 OR rather

	 : json.array!(@shifts) do |shift|
         :   json.extract! shift, :id, :title, :vols_needed, :user_ids
         :   json.url shift_url(shift, format: :json)
         : end

       - [ ] define pushShift()

       	 [[./app/assets/javascripts/angular/controllers/ShiftIndexCtrl.js.coffee]]

       - [X] define viewShift()

       	 [[./app/assets/javascripts/angular/controllers/ShiftIndexCtrl.js.coffee]]

       	 : @rest.controller 'RestaurantIndexCtrl', ['$scope', '$location', '$http', ($scope, $location, $http) ->
       	 :   $scope.restaurants = []
       	 :   $http.get('./restaurants.json').success((data) ->
       	 :     $scope.restaurants = data
       	 :   )
       	 :
       	 :   $scope.viewRestaurant = (id) ->
       	 :     $location.url "/restaurants/#{id}"
       	 : ]

	 OR rather

	 : @phill.controller 'ShiftIndexCtrl', ['$scope', '$location', '$http', ($scope, $location, $http) ->
         :   $scope.shifts = []
         :   $http.get('./shifts.json').success((data) ->
         :     $scope.shifts = data
         :   )
	 : 
         :   $scope.viewShift = (id) ->
         :     $location.url "/shifts/#{id}"        
         : ]

       - [X] Create show template, route and controller

       	 [[./public/templates/shifts/show.html]]

       	 : <h1>{{shift.title}}</h1>

       	 [[./app/assets/javascripts/main.js.coffee]]

       	 : @rest = angular.module('rest', [])
       	 :
       	 : @rest.config(['$routeProvider', ($routeProvider) ->
       	 :   $routeProvider.
       	 :     when('/restaurants', {
       	 :       templateUrl: '../templates/restaurants/index.html',
       	 :       controller: 'RestaurantIndexCtrl'
       	 :     }).
       	 :     when('/restaurants/:id', {
       	 :       templateUrl: '../templates/restaurants/show.html',
       	 :       controller: 'RestaurantShowCtrl'
       	 :     }).
       	 :     otherwise({
       	 :       templateUrl: '../templates/home.html',
       	 :       controller: 'HomeCtrl'
       	 :     })
       	 : ])

       	 [[./app/assets/javascripts/angular/controllers/ShiftShowCtrl.js.coffee]]

       	 : @rest.controller 'RestaurantShowCtrl', ['$scope', '$http', '$routeParams', ($scope, $http, $routeParams) ->
       	 :   $http.get("./restaurants/#{$routeParams.id}.json").success((data) ->
       	 :     $scope.restaurant = data
       	 :   )
       	 : ]





*** Routes

    [[./app/views/][Views Directory]]

    [[./config/routes.rb]]

    - [X] create root path

      : root 'static_pages#home'

    - [ ] create paths for desired routes

      : get "about" => "pages#about"
      : get "news" => "pages#news"
      : get "programs" => "pages#programs"
      : get "calendar" => "pages#calendar"
      : get "contact" => "contacts#new"
      : get "staffandboard" => "pages#staff"
      : get "jobs" => "pages#jobs"
      : get "donate" => "pages#donate"
      : get "camp" => "pages#summer_camp"
      : get "csv" => "pages#csvupload"
      : get "ccf" => "shifts#volunteer"



*** Controllers   

    [[./app/controllers/application_controller.rb]]

    [[./app/controllers/pages_controller.rb]]


* Application skeleton BASICS


** Useful commands

*** Rake

    : rake routes


*** Rails

    : rails console

    : rails s
    : rails s -e production

*** Heroku

    	       : heroku rename $NEW_NAME
 	       : heroku open
	       : heroku logs --tail
 	       : heroku run rails console
	       
	       : heroku config:set <ENV_NAME>=<variable>
	       : heroku config:unset
	       : heroku config:get


*** Git    

** Essential Files

   [[./Gemfile][Gemfile]]

** Create the default skeletal application

  - [X] create a new application

    : rails new PrairieHillWebsite
 
  - [X] update README

    : rm README.rdoc
    : touch README.org

  - [X] rename application.css to application.css.scss

    [[./app/assets/stylesheets/application.css.scss]]

    : cd app/assets/stylesheets
    : mv application.css application.css.scss

  - [X] Test the skeletal application

    - [X] Start the Rails server

      : rails s
    
    - [X] open your browser to localhost, port 3000

      : localhost:3000

  - [X] update the Gemfile

    [[./Gemfile]]

    : cat ~/RAILS-dev/DEFAULT-Gemfile > Gemfile

  - [X] update the bundle

    : bundle update
    : bundle install --without production

*** Set up Git and Heroku

**** Git

   - [X] initialize git repo

     : git init

   - [X] update .gitignore

     [[./.gitignore]]

     : echo ".env" >> .gitignore
     : echo "Procfile" >> .gitignore

   - [X] initial stage and commit of all files

     : git add .
     : git commit -am "initial commit"

   - [X] add the origin

     : git remote add origin https://github.com/son1112/PrairieHillWebsite.git

   - [X] initial push

     : git push -u origin master

**** Heroku

     - [X] Create and push a new heroku app

       : heroku create
       : git push heroku master
       
     - [X] Rename the heroku app

       : heroku rename phill-new


