README.html


<li>Building out the shifts page<br  /><div class="outline-text-7" id="text-3-3-1-0-0-6">
<p>
When you generate scaffolding in Rails 4, it gives you some .jbuilder files:
</p>

<p>
<a href="./app/views/shifts/index.json.jbuilder">./app/views/shifts/index.json.jbuilder</a>
</p>

<ul class="org-ul">
<li><code>[X]</code> Add :id parameter for json.extract!

<pre class="example">
json.array!(@restaurants) do |restaurant|
  json.extract! restaurant, :id, :name
  json.url restaurant_url(restaurant, format: :json)
end
</pre>

<p>
OR rather
</p>

<pre class="example">
json.array!(@shifts) do |shift|
  json.extract! shift, :id, :title, :vols_needed, :user_ids
  json.url shift_url(shift, format: :json)
end
</pre>
</li>

<li><code>[&#xa0;]</code> define pushShift()

<p>
<a href="./app/assets/javascripts/angular/controllers/ShiftIndexCtrl.js.coffee">./app/assets/javascripts/angular/controllers/ShiftIndexCtrl.js.coffee</a>
</p>
</li>

<li><code>[X]</code> define viewShift()

<p>
<a href="./app/assets/javascripts/angular/controllers/ShiftIndexCtrl.js.coffee">./app/assets/javascripts/angular/controllers/ShiftIndexCtrl.js.coffee</a>
</p>

<pre class="example">
@rest.controller 'RestaurantIndexCtrl', ['$scope', '$location', '$http', ($scope, $location, $http) -&gt;
  $scope.restaurants = []
  $http.get('./restaurants.json').success((data) -&gt;
    $scope.restaurants = data
  )

  $scope.viewRestaurant = (id) -&gt;
    $location.url "/restaurants/#{id}"
]
</pre>

<p>
OR rather
</p>

<pre class="example">
@phill.controller 'ShiftIndexCtrl', ['$scope', '$location', '$http', ($scope, $location, $http) -&gt;
  $scope.shifts = []
  $http.get('./shifts.json').success((data) -&gt;
    $scope.shifts = data
  )

  $scope.viewShift = (id) -&gt;
    $location.url "/shifts/#{id}"        
]
</pre>
</li>

<li><code>[X]</code> Create show template, route and controller

<p>
<a href="./public/templates/shifts/show.html">./public/templates/shifts/show.html</a>
</p>

<pre class="example">
&lt;h1&gt;{{shift.title}}&lt;/h1&gt;
</pre>

<p>
<a href="./app/assets/javascripts/main.js.coffee">./app/assets/javascripts/main.js.coffee</a>
</p>

<pre class="example">
@rest = angular.module('rest', [])

@rest.config(['$routeProvider', ($routeProvider) -&gt;
  $routeProvider.
    when('/restaurants', {
      templateUrl: '../templates/restaurants/index.html',
      controller: 'RestaurantIndexCtrl'
    }).
    when('/restaurants/:id', {
      templateUrl: '../templates/restaurants/show.html',
      controller: 'RestaurantShowCtrl'
    }).
    otherwise({
      templateUrl: '../templates/home.html',
      controller: 'HomeCtrl'
    })
])
</pre>

<p>
<a href="./app/assets/javascripts/angular/controllers/ShiftShowCtrl.js.coffee">./app/assets/javascripts/angular/controllers/ShiftShowCtrl.js.coffee</a>
</p>

<pre class="example">
@rest.controller 'RestaurantShowCtrl', ['$scope', '$http', '$routeParams', ($scope, $http, $routeParams) -&gt;
  $http.get("./restaurants/#{$routeParams.id}.json").success((data) -&gt;
    $scope.restaurant = data
  )
]
</pre>
</li>
</ul>
</div>
</li></ul>
</div>





<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2">Routes</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
<a href="./app/views/">Views Directory</a>
</p>

<p>
<a href="./config/routes.rb">./config/routes.rb</a>
</p>

<ul class="org-ul">
<li><code>[X]</code> create root path

<pre class="example">
root 'static_pages#home'
</pre>
</li>

<li><code>[&#xa0;]</code> create paths for desired routes

<pre class="example">
get "about" =&gt; "pages#about"
get "news" =&gt; "pages#news"
get "programs" =&gt; "pages#programs"
get "calendar" =&gt; "pages#calendar"
get "contact" =&gt; "contacts#new"
get "staffandboard" =&gt; "pages#staff"
get "jobs" =&gt; "pages#jobs"
get "donate" =&gt; "pages#donate"
get "camp" =&gt; "pages#summer_camp"
get "csv" =&gt; "pages#csvupload"
get "ccf" =&gt; "shifts#volunteer"
</pre>
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3">Controllers</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
<a href="./app/controllers/application_controller.rb">./app/controllers/application_controller.rb</a>
</p>

<p>
<a href="./app/controllers/pages_controller.rb">./app/controllers/pages_controller.rb</a>
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Application skeleton BASICS</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Useful commands</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1">Rake</h4>
<div class="outline-text-4" id="text-4-1-1">
<pre class="example">
rake routes
</pre>
</div>
</div>


<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2">Rails</h4>
<div class="outline-text-4" id="text-4-1-2">
<pre class="example">
rails console
</pre>

<pre class="example">
rails s
rails s -e production
</pre>
</div>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3">Heroku</h4>
<div class="outline-text-4" id="text-4-1-3">
<pre class="example">
heroku rename $NEW_NAME
heroku open
heroku logs --tail
heroku run rails console
</pre>

<pre class="example">
heroku config:set &lt;ENV_NAME&gt;=&lt;variable&gt;
heroku config:unset
heroku config:get
</pre>
</div>
</div>


<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4">Git</h4>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Essential Files</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="./Gemfile">Gemfile</a>
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">Create the default skeletal application</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li><code>[X]</code> create a new application

<pre class="example">
rails new PrairieHillWebsite
</pre>
</li>

<li><code>[X]</code> update README

<pre class="example">
rm README.rdoc
touch README.org
</pre>
</li>

<li><code>[X]</code> rename application.css to application.css.scss

<p>
<a href="./app/assets/stylesheets/application.css.scss">./app/assets/stylesheets/application.css.scss</a>
</p>

<pre class="example">
cd app/assets/stylesheets
mv application.css application.css.scss
</pre>
</li>

<li><code>[X]</code> Test the skeletal application

<ul class="org-ul">
<li><code>[X]</code> Start the Rails server

<pre class="example">
rails s
</pre>
</li>

<li><code>[X]</code> open your browser to localhost, port 3000

<pre class="example">
localhost:3000
</pre>
</li>
</ul>
</li>

<li><code>[X]</code> update the Gemfile

<p>
<a href="./Gemfile">./Gemfile</a>
</p>

<pre class="example">
cat ~/RAILS-dev/DEFAULT-Gemfile &gt; Gemfile
</pre>
</li>

<li><code>[X]</code> update the bundle

<pre class="example">
bundle update
bundle install --without production
</pre>
</li>
</ul>
</div>

<div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1">Set up Git and Heroku</h4>
<div class="outline-text-4" id="text-4-3-1">
</div><ul class="org-ul"><li>Git<br  /><div class="outline-text-5" id="text-4-3-1-1">
<ul class="org-ul">
<li><code>[X]</code> initialize git repo

<pre class="example">
git init
</pre>
</li>

<li><code>[X]</code> update .gitignore

<p>
<a href="./.gitignore">./.gitignore</a>
</p>

<pre class="example">
echo ".env" &gt;&gt; .gitignore
echo "Procfile" &gt;&gt; .gitignore
</pre>
</li>

<li><code>[X]</code> initial stage and commit of all files

<pre class="example">
git add .
git commit -am "initial commit"
</pre>
</li>

<li><code>[X]</code> add the origin

<pre class="example">
git remote add origin https://github.com/son1112/PrairieHillWebsite.git
</pre>
</li>

<li><code>[X]</code> initial push

<pre class="example">
git push -u origin master
</pre>
</li>
</ul>
</div>
</li>

<li>Heroku<br  /><div class="outline-text-5" id="text-4-3-1-2">
<ul class="org-ul">
<li><code>[X]</code> Create and push a new heroku app

<pre class="example">
heroku create
git push heroku master
</pre>
</li>

<li><code>[X]</code> Rename the heroku app

<pre class="example">
heroku rename phill-new
</pre>
</li>
</ul>
</div>
</li></ul>
</div>
</div>
</div>
</div>
</body>
</html>
